Update design doc
